const facts = [
    "واش فراسك؟ النملة كتقدر تهز 50 مرة قد الوزن ديالها.",
    "واش فراسك؟ المغرب هو أول دولة عتارفات باستقلال المريكان عام 1777.",
    "واش فراسك؟ العسل هو الماكلة الوحيدة اللي ما كتخسرش وممكن تبقى صالحة لآلاف السنين.",
    "واش فراسك؟ عينين النعامة كبر من دماغها.",
    "واش فراسك؟ القهوة هي ثاني أكثر سلعة كتباع فالعالم من بعد البترول.",
    "واش فراسك؟ الحوت د القرش ما كينعسش، خاصو يبقى يتحرك باش يتنفس.",
    "واش فراسك؟ الفراشة كتدوق الماكلة برجليها.",
    "واش فراسك؟ جامعة القرويين ففاس هي أقدم جامعة فالعالم مازال خدامة لدابا.",
    "واش فراسك؟ الأخطبوط عندو 3 د القلوب و 9 د الأدمغة.",
    "واش فراسك؟ صوت البط ما عندوش صدى، والعلماء ما عارفينش علاش حتى لدابا.",
    "واش فراسك؟ أطول رحلة طيران سجلتها دجاجة هي 13 ثانية.",
    "واش فراسك؟ الإنسان كينعس تقريباً ثلث حياتو.",
    "واش فراسك؟ الكروكوديل ما يقدرش يخرج لسانو من فمو.",
    "واش فراسك؟ المغرب فيه أكبر محطة للطاقة الشمسية فالعالم (نور ورزازات).",
    "واش فراسك؟ التفاح كيفيّق كثر من القهوة فالصباح.",
    "واش فراسك؟ الزرافة كتقدر تنقي ودنيها بلسانها، حيت طوييييل (تقريبا 50 سم).",
    "واش فراسك؟ أقدم هيكل عظمي لـ 'إنسان عاقل' (Homo Sapiens) تلقه فالمغرب (جبل إيغود) وعمرو كثر من 300,000 عام."
];

module.exports = async function (sock, chatId, message) {
    try {
        const randomFact = facts[Math.floor(Math.random() * facts.length)];

        await sock.sendMessage(chatId, {
            text: `💡 *معلومة* 💡\n\n${randomFact}`,
            footer: 'Hamza Amirni 🤖'
        }, { quoted: message });

    } catch (error) {
        console.error('Error fetching fact:', error);
        await sock.sendMessage(chatId, { text: '❌ وقع شي خطأ فالمعلومة.' }, { quoted: message });
    }
};
